/* Copyright (C) 2005-2026, UNIGINE. All rights reserved.
*
* This file is a part of the UNIGINE 2 SDK.
*
* Your use and / or redistribution of this software in source and / or
* binary form, with or without modification, is subject to: (i) your
* ongoing acceptance of and compliance with the terms and conditions of
* the UNIGINE License Agreement; and (ii) your inclusion of this notice
* in any version of this software that you use or redistribute.
* A copy of the UNIGINE License Agreement is available by contacting
* UNIGINE. at http://unigine.com/
*/

#pragma once
#include "UnigineMathLibCommon.h"

#include "UnigineMathLibVec2.h"
#include "UnigineMathLibVec3.h"
#include "UnigineMathLibVec4.h"

#include "UnigineMathLibDVec2.h"
#include "UnigineMathLibDVec3.h"
#include "UnigineMathLibDVec4.h"

#include "UnigineMathLibHVec2.h"
#include "UnigineMathLibHVec3.h"
#include "UnigineMathLibHVec4.h"

#include "UnigineMathLibIVec2.h"
#include "UnigineMathLibIVec3.h"
#include "UnigineMathLibIVec4.h"

#include "UnigineMathLibSVec4.h"
#include "UnigineMathLibBVec4.h"

#include "UnigineMathLibMat2.h"
#include "UnigineMathLibMat3.h"
#include "UnigineMathLibMat4.h"

#include "UnigineMathLibDMat4.h"

#include "UnigineMathLibQuat.h"

#include "UnigineMathLibSimd.h"
#include "UnigineMathLibGeometry.h"
#include "UnigineMathLibNumerical.h"
#include "UnigineMathLibRandom.h"
#include "UnigineMathLibNoise.h"
#include "UnigineMathLibSHBasis.h"
#include "UnigineMathLibColorSpaces.h"

namespace Unigine
{
namespace Math
{

static_assert(sizeof(vec2) == 2 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(vec3) == 4 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(vec4) == 4 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(dvec2) == 2 * sizeof(double), "struct size must remain unchanged");
static_assert(sizeof(dvec3) == 4 * sizeof(double), "struct size must remain unchanged");
static_assert(sizeof(dvec4) == 4 * sizeof(double), "struct size must remain unchanged");
static_assert(sizeof(hvec2) == 2 * sizeof(half), "struct size must remain unchanged");
static_assert(sizeof(hvec3) == 4 * sizeof(half), "struct size must remain unchanged");
static_assert(sizeof(hvec4) == 4 * sizeof(half), "struct size must remain unchanged");
static_assert(sizeof(ivec2) == 2 * sizeof(int), "struct size must remain unchanged");
static_assert(sizeof(ivec3) == 4 * sizeof(int), "struct size must remain unchanged");
static_assert(sizeof(ivec4) == 4 * sizeof(int), "struct size must remain unchanged");
static_assert(sizeof(bvec4) == 4 * sizeof(unsigned char), "struct size must remain unchanged");
static_assert(sizeof(svec4) == 4 * sizeof(unsigned short), "struct size must remain unchanged");
static_assert(sizeof(mat2) == 4 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(mat3) == 12 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(mat4) == 16 * sizeof(float), "struct size must remain unchanged");
static_assert(sizeof(dmat4) == 12 * sizeof(double), "struct size must remain unchanged");
static_assert(sizeof(quat) == 4 * sizeof(float), "struct size must remain unchanged");

//////////////////////////////////////////////////////////////////////////
// vec2
//////////////////////////////////////////////////////////////////////////
/// <summary>Constructor. Initializes the vector using a given three-component vec3 source vector: x=v.x, y=v.y.</summary>
UNIGINE_INLINE vec2::vec2(const vec3 &v)
	: x(v.x)
	, y(v.y)
{
	UNIGINE_ASSERT_ALIGNED8(this);
}
/// <summary>Constructor. Initializes the vector using a given four-component vec4 source vector: x=v.x, y=v.y.</summary>
UNIGINE_INLINE vec2::vec2(const vec4 &v)
	: x(v.x)
	, y(v.y)
{
	UNIGINE_ASSERT_ALIGNED8(this);
}
/// <summary>Constructor. Initializes the vector using a given dvec2 source vector.</summary>
UNIGINE_INLINE vec2::vec2(const dvec2 &v)
	: x(toFloat(v.x))
	, y(toFloat(v.y))
{
	UNIGINE_ASSERT_ALIGNED8(this);
}
/// <summary>Constructor. Initializes the vector using a given ivec2 source vector.</summary>
